<?php
// Директорія зберігання пунктів меню
$dir_lab = 'lab/';
// Директорія зберігання допоміжних дій (зчитування, відображення, ...).
$dir_functional = 'functional/';
// Директорія для зберігання важливих файлів.
$dir_data = '../data/';
// Зчитуємо вміст папки $dir_lab
$directs = scandir ( $dir_lab );
// Зчитуємо параметр 'lab' з адресного рядка - повинен дорівнювати одному з пунктів меню.
// По цьому параметру завантажується відповідний контент (назва папки з "laboratory").
$dir_for_contents = $_GET ['lab'];
?>