<!-- Загрузка даних з файла.
Файл містить інформацію про монітори у вигляді: марка монітору, 
модель, рік випуску, вартість, дата продажу, прізвище і ім’я покупця.
-->
<?php
// Зчитуєм вміст файла. $monitors містить усі рядки, які є у файлі.
$monitors = file ( $dir_data . "monitors.txt" );
// Рахуємо кількість елементів у масиві (кількість рядків або записів).
$count_of_monitors = count ( $monitors );
// Кожен рядок розбиваємо на рядки по табуляції. Таким чином отримаємо двовимірний масив.
for($i = 0; $i < $count_of_monitors; $i ++) {
	$monitors [$i] = explode ( "\t", $monitors [$i] );
}
?>
